KaSt/survAIv/c3oled/sdkconfig.defaults
# ESP32-C3 SuperMini with 0.42" SSD1306 OLED
CONFIG_IDF_TARGET="esp32c3"

# TLS + certs
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Flash — 4 MB, custom partition table
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# OTA enabled
CONFIG_SURVAIV_ENABLE_OTA=y

# Display — SSD1306 OLED via I2C
CONFIG_SURVAIV_HAS_DISPLAY=y
CONFIG_SURVAIV_DISPLAY_SSD1306_C3OLED=y
CONFIG_SURVAIV_SCREEN_TIMEOUT_SEC=30
CONFIG_SURVAIV_MARKET_LIMIT=6
